Revit 2024 API
ProjectInfo.OrganizationName Property
Get or Set the Organization Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string OrganizationName { get; set; }
Visual Basic
Public Property OrganizationName As String
	Get
	Set
Visual C++
public:
property String^ OrganizationName {
	String^ get ();
	void set (String^ value);
}
Remarks
This property is used to get or set the Project Number of the Project Information.
See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace